project/app/Controllers/Admin/Alunos.php

SELECT `alunos`.*, `turma_aluno`.`id_turma`, `turmas`.`nome` as `nome_turma`, `turmas`.`ano_letivo` as `ano_turma`, `turmas`.`periodo` as `periodo_turma`
FROM `alunos`
LEFT JOIN `turma_aluno` ON `turma_aluno`.`id_aluno` = `alunos`.`id`
LEFT JOIN `turmas` ON `turmas`.`id` = `turma_aluno`.`id_turma`
WHERE `alunos`.`deleted_at` is null
AND `alunos`.`deleted_at` IS NULL
ORDER BY `turmas`.`ano_letivo` DESC
---
    public function index($idPai = null)
    {

        $this->data['table'] = 	$this->alunosModel->select('alunos.*, turma_aluno.id_turma, turmas.nome as nome_turma, turmas.ano_letivo as ano_turma, turmas.periodo as periodo_turma')
                                                    ->join('turma_aluno', 'turma_aluno.id_aluno = alunos.id', 'left')
                                                    ->join('turmas', 'turmas.id = turma_aluno.id_turma', 'left')
                                                    ->where('alunos.deleted_at is null')
                                                    ->orderBy('turmas.ano_letivo', 'DESC')
                                                    ->findAll();

SELECT *
FROM `alunos`
WHERE `alunos`.`deleted_at` IS NULL
AND `alunos`.`id` = '1'
SELECT *
FROM `historico_escolar`
WHERE `id_aluno` = '1'
AND `historico_escolar`.`deleted_at` IS NULL
---
    public function historicoEscolar($idAluno)
    {

        $this->data['title'] = 'Histórico Escolar';
        $this->data['titleBreadcrumb'] = 'Histórico Escolar';
        $this->data['idAluno'] = $idAluno;
        $this->data['aluno'] = 	$this->alunosModel->find($idAluno);

        $this->data['table'] = $this->historicoEscolar->where('id_aluno', $idAluno)->findAll();

SELECT *
FROM `historico_escolar`
WHERE `historico_escolar`.`deleted_at` IS NULL
AND `historico_escolar`.`id` = '8'
SELECT *
FROM `alunos`
WHERE `alunos`.`deleted_at` IS NULL
AND `alunos`.`id` = '2'
---
    public function historicoEscolarNotas($idHistorico){


        $this->data['title'] = 'Disciplinas e Notas';
        $this->data['titleBreadcrumb'] = 'Disciplinas e Notas';
        $this->data['idHistorico'] = $idHistorico;

        $historico = $this->historicoEscolar->find($idHistorico);

        if (!$historico) {
            $alert = 'error';
            $message = 'Registro não encontrado!';
            $this->session->setFlashdata($alert, $message);
            return redirect()->back();
        }

        $this->data['aluno'] = 	$this->alunosModel->find($historico->id_aluno);

SELECT *
FROM `historico_escolar`
WHERE `historico_escolar`.`deleted_at` IS NULL
AND `historico_escolar`.`id` = '8'
---
            }
        }

        $historico = $this->historicoEscolar->find($idHistorico);

SELECT *
FROM `alunos`
WHERE `alunos`.`deleted_at` IS NULL
AND `alunos`.`id` = '2'
SELECT *
FROM `disciplinas`
WHERE `deleted_at` IS NULL
AND `disciplinas`.`deleted_at` IS NULL
---
            return redirect()->back();
        }

        $this->data['aluno'] = 	$this->alunosModel->find($historico->id_aluno);
        $this->data['idAluno'] = $historico->id_aluno;

        $this->data['disciplinas'] = (new \App\Models\Admin\DisciplinasModel())->where('deleted_at', null)->findAll();

INSERT INTO `historico_escolar_notas` (`id_disciplina`, `nota`, `id_historico`, `created_at`, `updated_at`) VALUES ('3', '10', '8', '2025-11-10 09:29:30', '2025-11-10 09:29:30')
---
    public function setHistoricoEscolarNotasCreate($idHistorico){

        $fields = 	$this->request->getVar();
        $fields['id_historico'] = $idHistorico;

        try {

            $this->historicoEscolarNotas->insert($fields);