project/app/Controllers/Admin/HistoricoEscolar.php

SELECT *
FROM `alunos`
WHERE `deleted_at` IS NULL
AND `alunos`.`deleted_at` IS NULL
ORDER BY `nome` ASC
---
    public function edit($id)
    {
        $historico = $this->historicoModel->find($id);

        if (!$historico) {
            $this->session->setFlashdata('alert', 'error');
            $this->session->setFlashdata('message', 'Histórico não encontrado!');
            return redirect()->to(base_url('Admin/HistoricoEscolar'));
        }

        $this->data['type'] = 'edit';
        $this->data['title'] = 'Editar Histórico Escolar';
        $this->data['titleBreadcrumb'] = 'Editar';
        $this->data['action'] = base_url('Admin/HistoricoEscolar/update/' . $id);
        $this->data['historico'] = $historico;
        $this->data['alunos'] = $this->alunosModel->where('deleted_at', null)->orderBy('nome', 'ASC')->findAll();