project/app/Controllers/Admin/Home.php

    public function index()
    {
        helper('auth');
        permission();

        $modelEmpresa = new EmpresaModel();


        $this->data	=	[
                        'empresa' => $modelEmpresa->first()
                        ];
---
SELECT *
FROM `empresa`
WHERE `empresa`.`deleted_at` IS NULL
 LIMIT 1