project/app/Controllers/Admin/Turmas.php

    public function alunosTurmas($idTurma)
    {
        permissionAdmin();

        $this->data['table'] = 	$this->alunosModel->select('alunos.*, turma_aluno.id_turma, turmas.nome as nome_turma, turmas.ano_letivo as ano_turma, turmas.periodo as periodo_turma')
                                                    ->join('turma_aluno', 'turma_aluno.id_aluno = alunos.id')
                                                    ->join('turmas', 'turmas.id = turma_aluno.id_turma', 'left')
                                                    ->where('turma_aluno.id_turma', $idTurma)
                                                    ->where('turma_aluno.deleted_at is null')
                                                    ->findAll();

        $parametrosModel = new ParametrosModel();
        $anoLetivo = $parametrosModel->getAnoLetivo()->valor;

        $subqueryMatriculadoEmQualquerAno = $this->alunosModel->builder()
            ->db()
            ->table('turma_aluno')
            ->select('1')
            ->where('turma_aluno.id_aluno = alunos.id'); // EXISTE alguma matrícula

        $subqueryMatriculadoNoAnoAtual = $this->alunosModel->builder()
            ->db()
            ->table('turma_aluno')
            ->select('1')
            ->where('turma_aluno.id_aluno = alunos.id')
            ->where('turma_aluno.ano_letivo', $anoLetivo); // MATRICULADO EM 2025

        $this->data['alunos'] = $this->alunosModel
            ->builder()
            ->where("NOT EXISTS (" . $subqueryMatriculadoNoAnoAtual->getCompiledSelect(false) . ")", null, false)
            ->where('alunos.deleted_at IS NULL')
            ->get()
            ->getResult();
---
SELECT `alunos`.*, `turma_aluno`.`id_turma`, `turmas`.`nome` as `nome_turma`, `turmas`.`ano_letivo` as `ano_turma`, `turmas`.`periodo` as `periodo_turma`
FROM `alunos`
JOIN `turma_aluno` ON `turma_aluno`.`id_aluno` = `alunos`.`id`
LEFT JOIN `turmas` ON `turmas`.`id` = `turma_aluno`.`id_turma`
WHERE `turma_aluno`.`id_turma` = '10'
AND `turma_aluno`.`deleted_at` is null
AND `alunos`.`deleted_at` IS NULL
SELECT *
FROM `alunos`
WHERE NOT EXISTS (SELECT 1
FROM `turma_aluno`
WHERE `turma_aluno`.`id_aluno` = `alunos`.`id`
AND `turma_aluno`.`ano_letivo` = '2025')
AND `alunos`.`deleted_at` IS NULL