project/app/Models/Admin/AlunosTurmasModel.php

	public function getAlunosByTurmaId($idTurma = null)
	{
		return $this->select('alunos.*, alunos.id as id_aluno, pais.*, turmas.nome as nome_turma, turmas.periodo as turma_periodo, turma_aluno.id, turma_aluno.id_aluno, turma_aluno.id_turma, turmas.nome as nome_turma, turmas.periodo as turma_periodo, turmas.ano_letivo as ano_letivo, turmas.grau as grau_turma')
					->join('alunos', 'alunos.id = turma_aluno.id_aluno')
					->join('pais', 'pais.id = alunos.id_pai', 'left')
					->join('turmas', 'turmas.id = turma_aluno.id_turma', 'left')
					->join('turma_professor', 'turma_professor.id_turma = turmas.id', 'left')
					->where('turma_aluno.id_turma', $idTurma)
					->where('turma_aluno.deleted_at is null')
					->where('alunos.deleted_at is null')
					->where('pais.deleted_at is null')
					->where('turmas.deleted_at is null')
					->where('turma_professor.deleted_at is null')
					->orderBy('alunos.nome', 'ASC')
					->findAll();
---
SELECT `alunos`.*, `alunos`.`id` as `id_aluno`, `pais`.*, `turmas`.`nome` as `nome_turma`, `turmas`.`periodo` as `turma_periodo`, `turma_aluno`.`id`, `turma_aluno`.`id_aluno`, `turma_aluno`.`id_turma`, `turmas`.`nome` as `nome_turma`, `turmas`.`periodo` as `turma_periodo`, `turmas`.`ano_letivo` as `ano_letivo`, `turmas`.`grau` as `grau_turma`
FROM `turma_aluno`
JOIN `alunos` ON `alunos`.`id` = `turma_aluno`.`id_aluno`
LEFT JOIN `pais` ON `pais`.`id` = `alunos`.`id_pai`
LEFT JOIN `turmas` ON `turmas`.`id` = `turma_aluno`.`id_turma`
LEFT JOIN `turma_professor` ON `turma_professor`.`id_turma` = `turmas`.`id`
WHERE `turma_aluno`.`id_turma` = '1'
AND `turma_aluno`.`deleted_at` is null
AND `alunos`.`deleted_at` is null
AND `pais`.`deleted_at` is null
AND `turmas`.`deleted_at` is null
AND `turma_professor`.`deleted_at` is null
AND `turma_aluno`.`deleted_at` IS NULL
ORDER BY `alunos`.`nome` ASC