project/app/Models/Admin/DisciplinasModel.php

SELECT *
FROM `disciplinas`
WHERE `disciplinas`.`deleted_at` IS NULL
---
	public function get($id = null)
	{

		if($id != null)
		{
			return $this->find($id);

		}

		return $this->findAll();