project/app/Models/Admin/HistoricoEscolarModel.php

    public function listarComAlunos()
    {
        return $this->select('historico_escolar.*, alunos.nome as nome_aluno, alunos.matricula')
                    ->join('alunos', 'alunos.id = historico_escolar.id_aluno')
                    ->where('historico_escolar.deleted_at', null)
                    ->orderBy('alunos.nome', 'ASC')
                    ->findAll();
---
SELECT `historico_escolar`.*, `alunos`.`nome` as `nome_aluno`, `alunos`.`matricula`
FROM `historico_escolar`
JOIN `alunos` ON `alunos`.`id` = `historico_escolar`.`id_aluno`
WHERE `historico_escolar`.`deleted_at` IS NULL
AND `historico_escolar`.`deleted_at` IS NULL
ORDER BY `alunos`.`nome` ASC