project/app/Models/Admin/HistoricoEscolarPeriodoModel.php

    public function getByHistorico($idHistorico)
    {
        return $this->where('id_historico', $idHistorico)
                    ->where('deleted_at', null)
                    ->orderBy('ordem', 'ASC')
                    ->orderBy('ano_letivo', 'ASC')
                    ->findAll();
---
SELECT *
FROM `historico_escolar_periodo`
WHERE `id_historico` = '2'
AND `deleted_at` IS NULL
AND `historico_escolar_periodo`.`deleted_at` IS NULL
ORDER BY `ordem` ASC, `ano_letivo` ASC