project/app/Models/Admin/HistoricoEscolarNotasModel.php

    public function getNotasByHistoricoId($idHistorico)
    {

        return $this->join('disciplinas', 'disciplinas.id = historico_escolar_notas.id_disciplina')
                    ->select('historico_escolar_notas.*, disciplinas.descricao as disciplina, disciplinas.carga_horaria as ch')
                    ->where('id_historico', $idHistorico)->findAll();
---
SELECT `historico_escolar_notas`.*, `disciplinas`.`descricao` as `disciplina`, `disciplinas`.`carga_horaria` as `ch`
FROM `historico_escolar_notas`
JOIN `disciplinas` ON `disciplinas`.`id` = `historico_escolar_notas`.`id_disciplina`
WHERE `id_historico` = '8'
AND `historico_escolar_notas`.`deleted_at` IS NULL