project/app/Models/Admin/HistoricoEscolarNotasModel.php

    public function getByPeriodo($idPeriodo)
    {
        return $this->select('historico_escolar_notas.*, historico_disciplinas.descricao as disciplina, historico_disciplinas.carga_horaria')
                    ->join('historico_disciplinas', 'historico_disciplinas.id = historico_escolar_notas.id_historico_disciplina')
                    ->where('historico_escolar_notas.id_periodo', $idPeriodo)
                    ->where('historico_escolar_notas.deleted_at', null)
                    ->orderBy('historico_disciplinas.descricao', 'ASC')
                    ->findAll();
---
SELECT `historico_escolar_notas`.*, `historico_disciplinas`.`descricao` as `disciplina`, `historico_disciplinas`.`carga_horaria`
FROM `historico_escolar_notas`
JOIN `historico_disciplinas` ON `historico_disciplinas`.`id` = `historico_escolar_notas`.`id_historico_disciplina`
WHERE `historico_escolar_notas`.`id_periodo` = '3'
AND `historico_escolar_notas`.`deleted_at` IS NULL
AND `historico_escolar_notas`.`deleted_at` IS NULL
ORDER BY `historico_disciplinas`.`descricao` ASC