project/app/Models/Admin/ParametrosModel.php

	public function getAnoLetivo()
	{
		return $this->where('chave', 'ANO_LETIVO')->first();
---
SELECT *
FROM `parametros`
WHERE `chave` = 'ANO_LETIVO'
AND `parametros`.`deleted_at` IS NULL
 LIMIT 1