project/app/Models/Admin/TurmasModel.php

SELECT *
FROM `turmas`
WHERE `ano_letivo` = '2025'
AND `turmas`.`deleted_at` IS NULL
---
	public function get($id = null)
	{
		$parametrosModel = new ParametrosModel();
		$anoLetivo = $parametrosModel->getAnoLetivo();

		if($id <> null)
		{
			return $this->where('ano_letivo', $anoLetivo->valor)->find($id);

		}

		if (!empty($anoLetivo = $anoLetivo->valor))
		{
			return $this->where('ano_letivo', $anoLetivo)->findAll();